Reports/НоменклатураПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>НоменклатураПроекта</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЦеныСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныСметы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредварительнаяСмета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредварительнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредварительнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредварительнаяНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НоменклатураПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредварительнаяНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АктуальныеСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АктуальныеСметы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредварительнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Листовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поганажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штучная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИзделияЭлемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЭлемент</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезАртикула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/НоменклатураПроекта/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ОбъектПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСметы.ПредварительнаяНоменклатура КАК Номенклатура,
		|	ЦеныСметы.Цена КАК НачальнаяЦена,
		|	ЦеныСметы.Цена КАК Цена,
		|	ИСТИНА КАК ВыборНоменклатуры,
		|	СУММА(ПредварительнаяСметаНоменклатура.Количество) КАК Всего,
		|	ЦеныСметы.ПредварительнаяСмета КАК ПредварительнаяСмета
		|ИЗ
		|	РегистрСведений.ЦеныСметы КАК ЦеныСметы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительнаяСмета.Номенклатура КАК ПредварительнаяСметаНоменклатура
		|		ПО ЦеныСметы.ПредварительнаяНоменклатура = ПредварительнаяСметаНоменклатура.Номенклатура
		|ГДЕ
		|	ЦеныСметы.Объект = &Объект
		|	И ПредварительнаяСметаНоменклатура.Ссылка.Изделие.Объект = &Объект
		|	И ПредварительнаяСметаНоменклатура.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА &СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЦеныСметы.ПредварительнаяНоменклатура.СтатьяЗатрат В ИЕРАРХИИ (&СтатьяЗатрат)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЦеныСметы.ПредварительнаяНоменклатура.ТипНоменклатуры = &ТипНоменклатуры
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныСметы.ПредварительнаяНоменклатура,
		|	ЦеныСметы.Цена,
		|	ЦеныСметы.Цена,
		|	ЦеныСметы.ПредварительнаяСмета
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныСметы.ПредварительнаяНоменклатура.Наименование";
	
	Запрос.УстановитьПараметр("СтатьяЗатрат", ЭтаФорма.СтатьяЗатрат);
	Запрос.УстановитьПараметр("ТипНоменклатуры", ЭтаФорма.ТипНоменклатуры);
	Запрос.УстановитьПараметр("Объект", Проект);
	
	ЭтаФорма.ТаблицаНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ЭтаФорма.ТаблицаНоменклатуры.Очистить();
	Если ЗначениеЗаполнено(Проект) Тогда
		ОбъектПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭлементУО = УсловноеОформление.Элементы.Добавить();				
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,11,Истина));
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНоменклатуры");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
    ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаНоменклатуры.НачальнаяЦена");
	ЭлементУсловия.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаНоменклатуры.Цена"); 
	
	ЭтаФорма.ИзменениеВСметахВУвеличение = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьВСметахНаСервере(Сделка,мНоменклатура,ИзменениеВСметахВУвеличение)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредварительнаяСметаНоменклатура.Ссылка КАК Смета,
		|	ПредварительнаяСметаНоменклатура.Номенклатура КАК Номенклатура,
		|	ЦеныПредварительнойСметы.Цена КАК Цена,
		|	НоменклатураПроекта.Цена КАК ЦенаОбъекта
		|ИЗ
		|	Документ.ПредварительнаяСмета.Номенклатура КАК ПредварительнаяСметаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныСметы КАК ЦеныПредварительнойСметы
		|		ПО ПредварительнаяСметаНоменклатура.Номенклатура = ЦеныПредварительнойСметы.ПредварительнаяНоменклатура
		|			И ПредварительнаяСметаНоменклатура.Ссылка = ЦеныПредварительнойСметы.ПредварительнаяСмета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПроекта КАК НоменклатураПроекта
		|		ПО ПредварительнаяСметаНоменклатура.Номенклатура = НоменклатураПроекта.Номенклатура
		|			И (НоменклатураПроекта.Проект = &Проект)
		|ГДЕ
		|	ПредварительнаяСметаНоменклатура.Ссылка.Изделие.Проект = &Проект
		|	И ПредварительнаяСметаНоменклатура.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА &ИзменениеВСметахВУвеличение
		|				ТОГДА НоменклатураПроекта.Цена > ЦеныПредварительнойСметы.Цена
		|			ИНАЧЕ НоменклатураПроекта.Цена <> ЦеныПредварительнойСметы.Цена
		|		КОНЕЦ
		|	И ПредварительнаяСметаНоменклатура.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	Запрос.УстановитьПараметр("Номенклатура", мНоменклатура);
	Запрос.УстановитьПараметр("ИзменениеВСметахВУвеличение", ИзменениеВСметахВУвеличение);
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	
	Для каждого х Из тзРезультат Цикл
		Для каждого текЗначения Из тзРезультат Цикл
			МенеджерЗаписей = РегистрыСведений.ЦеныСметы.СоздатьМенеджерЗаписи();
			МенеджерЗаписей.проект = Сделка;
			МенеджерЗаписей.ПредварительнаяНоменклатура = х.Номенклатура;
			МенеджерЗаписей.ПредварительнаяСмета = х.Смета;
			МенеджерЗаписей.Цена = х.ЦенаОбъекта;
			
		    МенеджерЗаписей.Записать();
		КонецЦикла;
		
	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВСметах(Команда)
	мНоменклатура = Новый Массив;
	Для каждого х Из ЭтаФорма.ТаблицаНоменклатуры Цикл
		Если х.ВыборНоменклатуры Тогда
			мНоменклатура.Добавить(х.Номенклатура);	
		КонецЕсли;
	КонецЦикла; 
	Если мНоменклатура.Количество() > 0 Тогда
		ИзменитьВСметахНаСервере(Проект, мНоменклатура, ЭтаФорма.ИзменениеВСметахВУвеличение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	ИзменитьВыбор(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	ИзменитьВыбор(Ложь);
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьВыбор(Значение)
	Для каждого х Из ЭтаФорма.ТаблицаНоменклатуры Цикл
		х.ВыборНоменклатуры = Значение;	
	КонецЦикла;

КонецПроцедуры // ИзменитьВыбор()

&НаКлиенте
Процедура ВозможноИзменение()

	ВозможноИзменение = Истина;
	
	Для каждого х Из ЭтаФорма.ТаблицаНоменклатуры Цикл
		Если НЕ х.НачальнаяЦена = х.Цена Тогда
			ВозможноИзменение = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
		
	Элементы.ФормаИзменитьВСметах.Доступность =	ВозможноИзменение;

КонецПроцедуры // ВозможноИзменение()


&НаКлиенте
Процедура ТаблицаНоменклатурыЦенаПриИзменении(Элемент)
	ВозможноИзменение();
КонецПроцедуры


&НаКлиенте
Процедура СтатьяЗатратПриИзменении(Элемент)
	ОбъектПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	ОбъектПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура СкрытьРасшифровку(Команда)
	Элементы.ГруппаРасшифровка.Видимость = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаРасшифровка.Видимость = Ложь;
КонецПроцедуры


&НаСервере
Функция РасшифровкаНаСервере(Объект,Номенклатура)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредварительнаяСметаНоменклатура.Ссылка.Изделие КАК ИзделиеЭлемент,
		|	СУММА(ПредварительнаяСметаНоменклатура.Количество) КАК Количество,
		|	ПредварительнаяСметаНоменклатура.РучноеДобавление КАК РучноеДобавление,
		|	ЕСТЬNULL(ЦеныПредварительнойСметы.Цена, 0) КАК Цена
		|ИЗ
		|	Документ.ПредварительнаяСмета.Номенклатура КАК ПредварительнаяСметаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныСметы КАК ЦеныПредварительнойСметы
		|		ПО ПредварительнаяСметаНоменклатура.Ссылка = ЦеныПредварительнойСметы.ПредварительнаяСмета
		|			И ПредварительнаяСметаНоменклатура.Номенклатура = ЦеныПредварительнойСметы.ПредварительнаяНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеСметы КАК АктуальныеСметы
		|		ПО ПредварительнаяСметаНоменклатура.Ссылка = АктуальныеСметы.Смета
		|ГДЕ
		|	ПредварительнаяСметаНоменклатура.Номенклатура = &Номенклатура
		|	И ПредварительнаяСметаНоменклатура.Ссылка.Изделие.Объект = &Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	ПредварительнаяСметаНоменклатура.Ссылка,
		|	ПредварительнаяСметаНоменклатура.РучноеДобавление,
		|	ПредварительнаяСметаНоменклатура.Ссылка.Изделие,
		|	ЕСТЬNULL(ЦеныПредварительнойСметы.Цена, 0)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Объект", Объект);
	
	
	ЭтаФорма.ТаблицаРасшифровка.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЭтаФорма.Элементы.ГруппаРасшифровка.Видимость = Истина;
	
КонецФункции


&НаКлиенте
Процедура Расшифровка()
	ТД = Элементы.ТаблицаНоменклатуры.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	
	РасшифровкаНаСервере(Проект,ТД.Номенклатура);
	ЭтаФорма.НоменклатураРасшифровки = ТД.Номенклатура;

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаРасшифровкаПередНачаломИзменения(Элемент, Отказ) 
	Параметр = Новый Структура("Ключ", Элемент.ТекущиеДанные.ИзделиеЭлемент);
	ОткрытьФорму("Справочник.ИзделияЭлемент.ФормаОбъекта",Параметр);
	Отказ = Истина;
КонецПроцедуры
